tests/performance/tmp/run345/inference_server_monitoring/merged.yml
---
execution:
- concurrency: 4
  hold-for: 20s
  ramp-up: 1s
  scenario: Inference
modules:
  jmeter:
    properties:
      hostname: 127.0.0.1
      input_filepath: kitten.jpg
      management_port: 8081
      port: 8080
      protocol: http
reporting:
- module: passfail
- data-source: pass-fail
  module: junit-xml
- data-source: sample-labels
  module: junit-xml
- dump-csv: ${BASEDIR}/final_stats.csv
  module: final-stats
scenarios:
  Inference:
    script: register_and_inference.jmx
services:
- module: monitoring
  server-agent:
  - address: localhost:9009
    interval: 1s
    label: mms-inference-server
    logging: true
    metrics:
    - sum_all_cpu_percent
    - sum_workers_memory_percent
    - frontend_file_descriptors
    - total_workers
settings:
  env:
    BASEDIR: .